#pragma once

//--------------------------------------------------------------
//  常時アニメーション 
//--------------------------------------------------------------
//  回転アニメーション
extern void rotateAnime(OBJ2D* obj);

//  拡大・縮小アニメーション
extern void scaleAnime(OBJ2D* obj);

//--------------------------------------------------------------
//  一時的アニメーション 
//--------------------------------------------------------------
//  X軸拡大・縮小アニメーション
extern bool xAxisSclaeAnime(OBJ2D* obj);
extern void setXAxisScaleAnime(OBJ2D* obj);