//******************************************************************************
//
//
//      タイトル
//
//
//******************************************************************************

//------< インクルード >----------------------------------------------------------
#include "all.h"

//------< 変数 >----------------------------------------------------------------
Title Title::instance_;

//--------------------------------------------------------------
//  更新処理
//--------------------------------------------------------------
void Title::update()
{
    switch (state_)
    {
    case 0:
        //////// 初期設定 ////////

        timer_ = 0;                                  // タイマーを初期化
        GameLib::setBlendMode(GameLib::Blender::BS_ALPHA);   // 通常のアルファ処理
        state_++;                                    // 初期化処理の終了

        /*fallthrough*/                             // 意図的にbreak;を記述していない

    case 1:
        //////// 通常時の処理 ////////

        timer_++;                            // タイマーを足す

        if (GameLib::input::TRG(0) & GameLib::input::PAD_START)             // PAD_TRG1が押されたら
            changeScene(Game::instance());  // ゲームシーンに切り替え

        break;
    }
}

//--------------------------------------------------------------
//  描画処理
//--------------------------------------------------------------
void Title::draw()
{
    // 画面クリア
    GameLib::clear(VECTOR4(0.2f, 0.3f, 1.0f, 1));

    // タイトル表示
    GameLib::font::textOut(4, "TEST", { 60, 60 }, { 4, 4 }, { 1, 1, 0, 1 });
}

//******************************************************************************
